package com.example.sample.sample_quiz0819;

/**
 * 問題文、選択肢、その問題の解答状況を配列として持つクラス、
 */
public class Mondaibun {


    public String[][] getMondai() {
        return mondai;
    }

    public void setMondai(String[][] mondai) {
        this.mondai = mondai;
    }

    /** 0       1      2~5         6
     * 問題文、正解、選択肢1~4、正解情報
     */
  private   String mondai[][] = {
            {"北海道の県庁所在地", "札幌", "青森", "盛岡", "仙台", "札幌", "0"},
            {"山形県の県庁所在地", "山形", "山形", "宇都宮", "前橋", "東京", "0"},
            {"群馬県の県庁所在地", "前橋", "横浜", "前橋", "京都", "水戸", "0"},
            {"福井県の県庁所在地", "福井", "秋田", "盛岡", "仙台", "福井", "0"},
            {"石川県の県庁所在地", "金沢", "前橋", "京都", "金沢", "盛岡", "0"},
            {"兵庫県の県庁所在地", "神戸", "神戸", "京都", "和歌山", "盛岡", "0"},
            {"山梨県の県庁所在地", "甲府", "前橋", "京都", "金沢", "甲府", "0"},
            {"長野県の県庁所在地", "長野", "前橋", "東京", "長野", "盛岡", "0"},
            {"岐阜県の県庁所在地", "岐阜", "前橋", "岐阜", "仙台", "札幌", "0"},
            {"静岡県の県庁所在地", "静岡", "静岡", "神戸", "京都", "和歌山", "0"},
    };

//
//    //問題と正解を二次元配列に格納
//    String str[][] = {
//            {"問題1 このホームページのタイトルは?", "1.HP作成講座",
//                    "2.はじめてのJava入門", "3.CGI対策講座", "2"},
//            {"問題2 管理人のハンドルネームは?", "1.たけはる", "2.たける", "3.たけりん", "1"},
//            {"問題3 新保の好きなプロ野球チームは？", "1.ヤクルト", "2.タイガース",
//                    "3.巨人", "3"},
//            {"問題4 熊田の出身地は?", "1.東京", "2.大阪", "3.福島", "3"},
//            {"問題5 管理人の誕生日は？", "1.1968年9月3日", "2.1971年11月18日",
//                    "3.1987年2月27日", "2"},
//
//            {"問題6 初任給", "1.20万", "2.25万", "3.28万", "3"}};

}
